CRUD/app/controllers/board_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."identifier" IS NULL LIMIT ?  [["LIMIT", 1]]
---
	def index
		@posts = Post.all
		@user = User.find_by(identifier: params[:identifier])

INSERT INTO "posts" ("nickname", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nickname", "익명"], ["title", "asdf"], ["content", "asfd"], ["created_at", "2022-05-17 19:35:32.734943"], ["updated_at", "2022-05-17 19:35:32.734943"]]
---
	def create
		nickname = params[:nickname]
		title = params[:title]
		content = params[:content]
		Post.create(nickname: nickname, title: title, content: content)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ㅎㅎ"], ["content", "ㅎㅎ"], ["updated_at", "2022-05-24 15:19:15.223502"], ["id", 4]]
---
	def update
		@post = Post.find(params[:id])
		@post.title = params[:title]
		@post.content = params[:content]
		@post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
	def delete
		@post = Post.find(params[:id])
		@post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."identifier" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
	def post
		@post = Post.find(params[:id])
		@user = User.find_by(identifier: params[:identifier])
		current_user = @user
		@comments = @post.comments.all