CRUD/app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = Comment.new
		@comment.nickname = params[:nickname]
		@comment.content = params[:content]
		@comment.post_id = params[:post_id]
		@comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("nickname", "content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nickname", "테스트"], ["content", "ggg"], ["post_id", 5], ["created_at", "2022-05-24 18:01:15.020591"], ["updated_at", "2022-05-24 18:01:15.020591"]]

	def edit
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:comment_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 27], ["id", 26], ["LIMIT", 1]]

	def update
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:comment_id])
		@comment.content = params[:content]
		@comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 27], ["id", 26], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "asd"], ["updated_at", "2022-11-21 01:02:55.617916"], ["id", 26]]

	def delete
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:comment_id])
		@comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 5], ["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]