CRUD/app/controllers/sessions_controller.rb

  def create
    if params[:identifier].present? && params[:password].present?
      user = User.find_by(identifier: params[:identifier])
---
SELECT  "users".* FROM "users" WHERE "users"."identifier" = ? LIMIT ?  [["identifier", "admin"], ["LIMIT", 1]]