CRUD/app/controllers/users_controller.rb

INSERT INTO "users" ("nickname", "identifier", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
#		@user.nickname = params[:nickname]
#		@user.identifier = params[:identifier]
#		@user.password = params[:password_digest]

		if @user.save